src/test/resources/authRequest.xml

<!--

    Licensed to Jasig under one or more contributor license
    agreements. See the NOTICE file distributed with this work
    for additional information regarding copyright ownership.
    Jasig licenses this file to you under the Apache License,
    Version 2.0 (the "License"); you may not use this file
    except in compliance with the License. You may obtain a
    copy of the License at:

    http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing,
    software distributed under the License is distributed on
    an "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
    KIND, either express or implied. See the License for the
    specific language governing permissions and limitations
    under the License.

-->

<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <paos:Request xmlns:paos="urn:liberty:paos:2003-08"
            S:actor="http://schemas.xmlsoap.org/soap/actor/next" S:mustUnderstand="1"
            responseConsumerURL="https://oim.test.iam.wisconsin.edu/Shibboleth.sso/SAML2/ECP"
            service="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp"/>
        <ecp:Request xmlns:ecp="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp" IsPassive="0"
            S:actor="http://schemas.xmlsoap.org/soap/actor/next" S:mustUnderstand="1">
            <saml:Issuer xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
                >https://oim.test.iam.wisconsin.edu/shibboleth</saml:Issuer>
        </ecp:Request>
        <ecp:RelayState xmlns:ecp="urn:oasis:names:tc:SAML:2.0:profiles:SSO:ecp"
            S:actor="http://schemas.xmlsoap.org/soap/actor/next" S:mustUnderstand="1"
            >cookie:6ffdff73</ecp:RelayState>
    </S:Header>
    <S:Body>
        <samlp:AuthnRequest xmlns:samlp="urn:oasis:names:tc:SAML:2.0:protocol"
            AssertionConsumerServiceURL="https://oim.test.iam.wisconsin.edu/Shibboleth.sso/SAML2/ECP"
            ID="_01a6144d585dacb2c7f548d21cd78dec" IssueInstant="2010-07-01T20:58:27Z"
            ProtocolBinding="urn:oasis:names:tc:SAML:2.0:bindings:PAOS" Version="2.0">
            <saml:Issuer xmlns:saml="urn:oasis:names:tc:SAML:2.0:assertion"
                >https://oim.test.iam.wisconsin.edu/shibboleth</saml:Issuer>
            <samlp:NameIDPolicy AllowCreate="1"/>
        </samlp:AuthnRequest>
    </S:Body>
</S:Envelope>
